app/Controllers/Transaksi.php

    public function akun3()
    {
        $akun3 = model(ModelAkun3::class);
        $result = $akun3->findAll();
---
SELECT *
FROM `akun3s`

    public function status()
    {
        $status = model(ModelStatus::class);
        $result = $status->findAll();
---
SELECT *
FROM `tbl_status`